# Pandas Serisi Oluşturmak

In [3]:
import pandas as pd

In [8]:
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [5]:
seri = pd.Series([10,88,3,4,5])

In [6]:
type(seri)

pandas.core.series.Series

In [9]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [10]:
seri.dtype

dtype('int64')

In [11]:
seri.size

5

In [12]:
seri.ndim

1

In [13]:
seri.values

array([10, 88,  3,  4,  5], dtype=int64)

In [14]:
seri.head(3)
#baştan setlere bakar.

0    10
1    88
2     3
dtype: int64

In [15]:
seri.tail(3)
#sondan setlere bakar.

2    3
3    4
4    5
dtype: int64

In [ ]:
 # index isimlendirmeleri

In [17]:
pd.Series([15,245,331242,92134,1125])

0        15
1       245
2    331242
3     92134
4      1125
dtype: int64

In [20]:
pd.Series([15,245,331242,92134,1125], index = [10,11,12,13,14])
# indexleri isimlendirdik, sadece numerik değil string ifadelerle de isimlendirilebilir.

10        15
11       245
12    331242
13     92134
14      1125
dtype: int64

In [26]:
seri = pd.Series([15,245,331242,92134,1125], index = ["a","b","c","d","e"])
pd.Series([15,245,331242,92134,1125], index = ["a","b","c","d","e"])

a        15
b       245
c    331242
d     92134
e      1125
dtype: int64

In [25]:
seri["a":"c"]

a        15
b       245
c    331242
dtype: int64

In [ ]:
#sözlük üzerinden liste oluşturmak

In [27]:
sozluk = {"reg":10, "log":11,"cart":12}

In [28]:
seri = pd.Series(sozluk)

In [29]:
seri

reg     10
log     11
cart    12
dtype: int64

In [ ]:
# iki seriyi birleştirerek seri oluşturma

In [30]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

# Eleman işlemleri

In [4]:
import numpy as np

In [32]:
a = np.array([412,1231,5346,6242,121])

In [35]:
seri = pd.Series(a)
seri

0     412
1    1231
2    5346
3    6242
4     121
dtype: int32

In [36]:
seri[0]

412

In [37]:
seri[0:2]

0     412
1    1231
dtype: int32

In [40]:
seri = pd.Series([218213,124141,213127,7921235], 
                 index = ["reg","loj","cart","rf"])
seri

reg      218213
loj      124141
cart     213127
rf      7921235
dtype: int64

In [41]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [42]:
seri.keys

<bound method Series.keys of reg      218213
loj      124141
cart     213127
rf      7921235
dtype: int64>

In [43]:
list(seri.items())

[('reg', 218213), ('loj', 124141), ('cart', 213127), ('rf', 7921235)]

In [44]:
seri.values

array([ 218213,  124141,  213127, 7921235], dtype=int64)

In [ ]:
#eleman sorgulama

In [45]:
"reg" in seri

True

In [46]:
seri["reg"]

218213

In [47]:
seri[["rf","reg"]]

rf     7921235
reg     218213
dtype: int64

In [48]:
seri["rf"] = 120
seri

reg     218213
loj     124141
cart    213127
rf         120
dtype: int64

# Pandas ile DataFrame Oluşturma

In [49]:
l = [1,2,3,4,5]
l

[1, 2, 3, 4, 5]

In [51]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              3
3              4
4              5

In [54]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [57]:
pd.DataFrame(m, columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [ ]:
#df isimlendirme

In [58]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [59]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [60]:
df.columns = ("deg1","deg2","deg3")
df.columns

Index(['deg1', 'deg2', 'deg3'], dtype='object')

In [61]:
type(df)

pandas.core.frame.DataFrame

In [62]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [63]:
df.shape

(3, 3)

In [64]:
df.ndim

2

In [65]:
df.size

9

In [66]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [67]:
type(df.values)

numpy.ndarray

In [68]:
df.head(1)

   deg1  deg2  deg3
0     1     2     3

In [69]:
df.tail(2)

   deg1  deg2  deg3
1     4     5     6
2     7     8     9

In [70]:
a = np.array([1,2,3,4,5])

In [71]:
pd.DataFrame(a,columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

# Eleman İşlemleri

In [5]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [6]:
sozluk = {"var1": s1, "var2": s2, "var3":s3}

In [7]:
sozluk

{'var1': array([3, 1, 5, 8, 5]),
 'var2': array([5, 9, 0, 8, 1]),
 'var3': array([5, 8, 9, 7, 0])}

In [10]:
import pandas as pd
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     3     5     5
1     1     9     8
2     5     0     9
3     8     8     7
4     5     1     0

In [77]:
df[0:1]

   var1  var2  var3
0     2     0     2

In [78]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
df.index = ["a","b","c","d","e"] 
df

   var1  var2  var3
a     3     5     5
b     1     9     8
c     5     0     9
d     8     8     7
e     5     1     0

In [85]:
#silme

In [96]:
df.drop("a", axis = 0)

   var1  var2  var3
b     1     4     8
c     1     6     6
d     5     4     2
e     7     4     0

In [86]:
df
# veri setinin ana yapısı üzerinde değişiklik olmaz

   var1  var2  var3
a     2     0     2
b     2     9     9
c     7     7     1
d     9     2     4
e     1     2     4

In [12]:
df.drop("a", axis = 0, inplace = True)
df

   var1  var2  var3
b     1     9     8
c     5     0     9
d     8     8     7
e     5     1     0

In [ ]:
# inplace komutu kalıcı olarak siler

In [98]:
#fancy

In [13]:
l = ["c","e"]

In [14]:
df.drop(l, axis = 0)

   var1  var2  var3
b     1     9     8
d     8     8     7

In [101]:
# degiskenler için

In [15]:
"var1" in df

True

In [16]:
l = ["var1","var4","var2"]

In [17]:
for i in l:
    print(i in df)

True
False
True

In [105]:
df

   var1  var2  var3
b     1     4     8
c     1     6     6
d     5     4     2
e     7     4     0

In [18]:
df["var4"] = df["var1"] * df["var2"]
df

   var1  var2  var3  var4
b     1     9     8     9
c     5     0     9     0
d     8     8     7    64
e     5     1     0     5

In [110]:
#degisken silme

In [19]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     1     9     8
c     5     0     9
d     8     8     7
e     5     1     0

In [20]:
df.drop("var4", axis = 1, inplace = True)
df

   var1  var2  var3
b     1     9     8
c     5     0     9
d     8     8     7
e     5     1     0

In [21]:
l = ["var1","var2"]

In [22]:
df.drop(l, axis = 1)

   var3
b     8
c     9
d     7
e     0

# Birleştirme(Join) İşlemleri

In [61]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    25     1    21
1    29    26    26
2    15    23     1
3    28     7     2
4    14    10     5

In [46]:
df2 = df1 + 99

In [47]:
df2

   var1  var2  var3
0   108   118   122
1   124   103   108
2   111   115   111
3   128   116   109
4   117   100   107

In [48]:
pd.concat([df1,df2])

   var1  var2  var3
0     9    19    23
1    25     4     9
2    12    16    12
3    29    17    10
4    18     1     8
0   108   118   122
1   124   103   108
2   111   115   111
3   128   116   109
4   117   100   107

In [29]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]',
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool' = True,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\emiralp\appdata\local\programs\python\python310\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [49]:
pd.concat([df1,df2], ignore_index = True)

   var1  var2  var3
0     9    19    23
1    25     4     9
2    12    16    12
3    29    17    10
4    18     1     8
5   108   118   122
6   124   103   108
7   111   115   111
8   128   116   109
9   117   100   107

In [36]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [37]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [62]:
df2.columns = ["var1","var2","deg1"]

In [56]:
pd.concat([df1, df2], join = "inner", ignore_index = True)

   var1  var2
0    17     7
1     8    14
2    25    28
3    23    26
4     9    11
5   108   118
6   124   103
7   111   115
8   128   116
9   117   100

# İleri Birleştirme İşlemleri

In [ ]:
# birebir birleştirme

In [67]:
df1 = pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                    'grup':['Muhasebe','Muhendislik','Muhendislik','IK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [66]:
df2 = pd.DataFrame({'calisanlar':['Ayse','Ali','Veli','Fatma'],
                    'ilk_giris':[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [68]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [69]:
pd.merge(df1,df2, on = "calisanlar")
# merge komutu nereden birleştireceğini kendisi anlar fakat
# biz on komutu ile nerde birleştirileceğini belirleyebiliyoruz.

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [70]:
# coktan teke

In [71]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [74]:
df4 = pd.DataFrame({'grup': ['Muhasebe','Muhendislik','IK'],
                   'mudur': ['Caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [75]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           IK       2019  Berkcan

In [76]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                             'Muhendislik','Muhendislik','IK','IK'],
                    'yetenekler': ['matematik','excel','kodlama',
                                   'linux','excel','yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [82]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           IK      excel
7      Fatma           IK    yonetim

# Toplulaşma ve Gruplama(Aggregation & Grouping)

##### Basit toplulaştırma fonksiyonaları:

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [6]:
import seaborn as sns

In [36]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [10]:
df.shape

(1035, 6)

In [37]:
df.mean()

C:\Users\emiralp\AppData\Local\Temp/ipykernel_7040/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [38]:
df["mass"].mean()
#ortamala

2.6381605847953216

In [15]:
df["mass"].count()

513

In [16]:
df["mass"].min()

0.0036

In [17]:
df["mass"].max()

25.0

In [18]:
df["mass"].sum()

1353.37638

In [19]:
df["mass"].std()

3.8186166509616046

In [21]:
df["mass"].var()

14.58183312700122

In [23]:
df.describe()
#toplu hali

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [30]:
df.describe().T
#transpozu

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [27]:
df.dropna().describe().T
#eksik değerler olsa dahi betimsel değerlere bakılılabilir.

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama İşlemleri

In [32]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'veri': [10,11,52,23,43,55]}, columns = ['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [34]:
df.groupby("gruplar").mean()
# gruplama işlemi

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [39]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [41]:
df.groupby("method")["orbital_period"].mean()
#gruplama yapılıyor ardından neye göre gruplama yapılacağı belirleniyor.

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [42]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# İleri Toplulaştırma İşlemleri(Agggregatei, filter, transform, apply)

In [44]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,11,52,23,43,55],
                  'degisken2': [100,121,525,2123,433,515]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        121
2       C         52        525
3       A         23       2123
4       B         43        433
5       C         55        515

In [45]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.5     1111.5
B             27.0      277.0
C             53.5      520.0

In [50]:
import numpy as np
df.groupby("gruplar").aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min  median   max
gruplar
A              10   16.5  23       100  1111.5  2123
B              11   27.0  43       121   277.0   433
C              52   53.5  55       515   520.0   525

In [53]:
df.groupby("gruplar").aggregate({"degisken1": min,"degisken2": max})

         degisken1  degisken2
gruplar
A               10       2123
B               11        433
C               52        525

In [54]:
# filter

In [55]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,11,52,23,43,55],
                  'degisken2': [100,121,525,2123,433,515]},
                  columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        121
2       C         52        525
3       A         23       2123
4       B         43        433
5       C         55        515

In [67]:
def filter_func(x):
    return x["degisken1"].std() > 10
# kendi tanımladığımız fonksiyon

In [62]:
df.groupby("gruplar").std()

         degisken1    degisken2
gruplar
A         9.192388  1430.477018
B        22.627417   220.617316
C         2.121320     7.071068

In [66]:
df.groupby("gruplar").filter(filter_func)
# kendi kodladığımız fonksiyonu kullanıyoruz

  gruplar  degisken1  degisken2
1       B         11        121
4       B         43        433

In [68]:
# transform

In [69]:
df["degisken1"]*10

0    100
1    110
2    520
3    230
4    430
5    550
Name: degisken1, dtype: int64

In [72]:
df_a = df.iloc[:,1:3]

In [75]:
df_a.transform(lambda x: x-x.mean() / x.std())

   degisken1    degisken2
0   8.405244    99.154682
1   9.405244   120.154682
2  50.405244   524.154682
3  21.405244  2122.154682
4  41.405244   432.154682
5  53.405244   514.154682

In [78]:
# apply
# dataframelerde gezebilen toplulaştırma işlemi

In [84]:
df = pd.DataFrame({'degisken1': [10,11,52,23,43,55],
                   'degisken2': [100,121,525,2123,433,515]},
                   columns = ['degisken1','degisken2'])
df

   degisken1  degisken2
0         10        100
1         11        121
2         52        525
3         23       2123
4         43        433
5         55        515

In [79]:
df.apply(np.sum)

degisken1     194
degisken2    3817
dtype: int64

In [85]:
df.apply(np.mean)

degisken1     32.333333
degisken2    636.166667
dtype: float64

# Pivot Tablolar

In [88]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [93]:
titanic.groupby("sex")[["survived"]].mean()
# iki tane köşeli parantez atarsak daha düzenli olur

        survived
sex
female  0.742038
male    0.188908

In [96]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [97]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [98]:
# pivot ile table

In [99]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [101]:
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [102]:
titanic.pivot_table("survived", ["sex",age],  "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# Dış Kaynaklı Veri Okumak

In [106]:
#csv okuma
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [110]:
# txt okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [113]:
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [114]:
df = pd.read_excel("reading_data/ornekx.xlsx")

In [115]:
type(df)

pandas.core.frame.DataFrame

In [116]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [119]:
df.columns = ("A","B","C")
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [122]:
# sıfırdan txt okuma
data = pd.read_csv("data.txt")

In [123]:
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4